tangyangguang/Esp32Base/src/web/internal/WebStatus.cpp
#include "../../Esp32BaseProfile.h"

#if ESP32BASE_ENABLE_WEB

#include "WebInternal.h"

namespace esp32base_web {

#if ESP32BASE_ENABLE_WATCHDOG
WatchdogTripState readWatchdogTripState() {
    WatchdogTripState state = {};
    state.lifetime = Esp32BaseWatchdog::lifetimeResetCount();
    const int32_t base = Esp32BaseConfig::getInt("eb_sys", "wdt_trip_base", -1);
    state.hasBase = base >= 0;
    state.base = state.hasBase ? static_cast<uint32_t>(base) : 0;
    state.resetTime = static_cast<uint32_t>(Esp32BaseConfig::getInt("eb_sys", "wdt_trip_time", 0));
    state.invalidBase = state.hasBase && state.base > state.lifetime;
    state.trip = (!state.invalidBase && state.lifetime >= state.base) ? state.lifetime - state.base : 0;
    return state;
}

bool formatEpochTime(uint32_t epoch, char* out, size_t len) {
    if (!out || len == 0 || epoch == 0) {
        return false;
    }
#if ESP32BASE_ENABLE_TIME
    return Esp32BaseTime::formatEpoch(epoch, out, len, "%Y-%m-%d %H:%M:%S");
#else
    out[0] = '\0';
    return false;
#endif
}

void formatWatchdogTripResetAt(const WatchdogTripState& state, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (!state.hasBase) {
        strlcpy(out, "never", len);
        return;
    }
    if (state.invalidBase) {
        strlcpy(out, "invalid baseline", len);
        return;
    }
#if ESP32BASE_ENABLE_TIME
    if (state.resetTime >= ESP32BASE_TIME_SYNC_MIN_EPOCH && formatEpochTime(state.resetTime, out, len)) {
        return;
    }
#endif
    strlcpy(out, "unknown (time unavailable)", len);
}

uint32_t currentWatchdogTripResetTime() {
#if ESP32BASE_ENABLE_TIME
    const Esp32BaseTime::Snapshot time = Esp32BaseTime::snapshot();
    if (time.synced) {
        return time.epochSec;
    }
#endif
    return 0;
}
#endif

void formatMac(uint64_t mac, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    snprintf(out, len, "%02X:%02X:%02X:%02X:%02X:%02X",
             static_cast<unsigned>(mac & 0xff),
             static_cast<unsigned>((mac >> 8) & 0xff),
             static_cast<unsigned>((mac >> 16) & 0xff),
             static_cast<unsigned>((mac >> 24) & 0xff),
             static_cast<unsigned>((mac >> 32) & 0xff),
             static_cast<unsigned>((mac >> 40) & 0xff));
}

const char* partitionTypeName(esp_partition_type_t type) {
    switch (type) {
        case ESP_PARTITION_TYPE_APP: return "app";
        case ESP_PARTITION_TYPE_DATA: return "data";
        default: return "unknown";
    }
}

const char* partitionSubtypeName(const esp_partition_t* partition) {
    if (!partition) {
        return "unknown";
    }
    if (partition->type == ESP_PARTITION_TYPE_APP) {
        if (partition->subtype >= ESP_PARTITION_SUBTYPE_APP_OTA_MIN &&
            partition->subtype <= ESP_PARTITION_SUBTYPE_APP_OTA_MAX) {
            return partition->label;
        }
        switch (partition->subtype) {
            case ESP_PARTITION_SUBTYPE_APP_FACTORY: return "factory";
            case ESP_PARTITION_SUBTYPE_APP_TEST: return "test";
            default: return "app";
        }
    }
    if (partition->type == ESP_PARTITION_TYPE_DATA) {
        switch (partition->subtype) {
            case ESP_PARTITION_SUBTYPE_DATA_NVS: return "nvs";
            case ESP_PARTITION_SUBTYPE_DATA_PHY: return "phy";
            case ESP_PARTITION_SUBTYPE_DATA_OTA: return "ota";
            case ESP_PARTITION_SUBTYPE_DATA_SPIFFS: return "spiffs";
            case ESP_PARTITION_SUBTYPE_DATA_COREDUMP: return "coredump";
            default: return "data";
        }
    }
    return "unknown";
}

bool samePartition(const esp_partition_t* a, const esp_partition_t* b) {
    return a && b && a->address == b->address && a->size == b->size &&
           a->type == b->type && a->subtype == b->subtype &&
           strncmp(a->label, b->label, sizeof(a->label)) == 0;
}

void webBytesToHex(const uint8_t* bytes, size_t len, char* out, size_t outLen) {
    static const char* hex = "0123456789abcdef";
    if (!out || outLen < len * 2 + 1) {
        return;
    }
    for (size_t i = 0; i < len; ++i) {
        out[i * 2] = hex[(bytes[i] >> 4) & 0x0f];
        out[i * 2 + 1] = hex[bytes[i] & 0x0f];
    }
    out[len * 2] = '\0';
}

const char* otaImageStateName(const esp_partition_t* partition) {
    if (!partition || partition->type != ESP_PARTITION_TYPE_APP ||
        partition->subtype < ESP_PARTITION_SUBTYPE_APP_OTA_MIN ||
        partition->subtype > ESP_PARTITION_SUBTYPE_APP_OTA_MAX) {
        return "n/a";
    }
    esp_ota_img_states_t state;
    const esp_err_t err = esp_ota_get_state_partition(partition, &state);
    if (err == ESP_ERR_NOT_FOUND) {
        return "undefined";
    }
    if (err != ESP_OK) {
        return "unknown";
    }
    switch (state) {
        case ESP_OTA_IMG_NEW: return "new";
        case ESP_OTA_IMG_PENDING_VERIFY: return "pending_verify";
        case ESP_OTA_IMG_VALID: return "valid";
        case ESP_OTA_IMG_INVALID: return "invalid";
        case ESP_OTA_IMG_ABORTED: return "aborted";
        case ESP_OTA_IMG_UNDEFINED: return "undefined";
        default: return "unknown";
    }
}

void partitionImageSha256(const esp_partition_t* partition, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    out[0] = '\0';
    if (!partition || partition->type != ESP_PARTITION_TYPE_APP) {
        return;
    }
    uint8_t digest[32];
    if (esp_partition_get_sha256(partition, digest) == ESP_OK) {
        webBytesToHex(digest, sizeof(digest), out, len);
    }
}

void partitionAppVersion(const esp_partition_t* partition, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    out[0] = '\0';
    if (!partition || partition->type != ESP_PARTITION_TYPE_APP) {
        return;
    }
    esp_app_desc_t desc;
    if (esp_ota_get_partition_description(partition, &desc) == ESP_OK) {
        strlcpy(out, desc.version, len);
    }
}

void sendPartitionJson(const char* key, const esp_partition_t* partition) {
    char sha[65] = "";
    char version[33] = "";
    sendChunk("\"");
    sendEscapedJsonChunk(key);
    sendChunk("\":");
    if (!partition) {
        sendChunk("null");
        return;
    }
    partitionImageSha256(partition, sha, sizeof(sha));
    partitionAppVersion(partition, version, sizeof(version));
    sendChunk("{\"label\":\"");
    sendEscapedJsonChunk(partition->label);
    sendChunk("\",\"address\":");
    sendIntChunk(static_cast<int>(partition->address));
    sendChunk(",\"size\":");
    sendBytesJsonChunk(partition->size);
    sendChunk(",\"state\":\"");
    sendEscapedJsonChunk(otaImageStateName(partition));
    sendChunk("\",\"sha256\":\"");
    sendEscapedJsonChunk(sha);
    sendChunk("\",\"version\":\"");
    sendEscapedJsonChunk(version);
    sendChunk("\"}");
}

void sendAppPartitionsJson() {
    const esp_partition_t* running = esp_ota_get_running_partition();
    const esp_partition_t* boot = esp_ota_get_boot_partition();
    const esp_partition_t* nextOta = esp_ota_get_next_update_partition(nullptr);
    bool first = true;
    sendChunk("\"appPartitions\":[");
    esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, nullptr);
    while (it) {
        const esp_partition_t* p = esp_partition_get(it);
        if (p) {
            char sha[65] = "";
            char version[33] = "";
            partitionImageSha256(p, sha, sizeof(sha));
            partitionAppVersion(p, version, sizeof(version));
            if (!first) {
                sendChunk(",");
            }
            first = false;
            sendChunk("{\"label\":\"");
            sendEscapedJsonChunk(p->label);
            sendChunk("\",\"subtype\":\"");
            sendEscapedJsonChunk(partitionSubtypeName(p));
            sendChunk("\",\"address\":");
            sendIntChunk(static_cast<int>(p->address));
            sendChunk(",\"size\":");
            sendBytesJsonChunk(p->size);
            sendChunk(",\"running\":");
            sendChunk(samePartition(p, running) ? "true" : "false");
            sendChunk(",\"boot\":");
            sendChunk(samePartition(p, boot) ? "true" : "false");
            sendChunk(",\"nextUpdate\":");
            sendChunk(samePartition(p, nextOta) ? "true" : "false");
            sendChunk(",\"state\":\"");
            sendEscapedJsonChunk(otaImageStateName(p));
            sendChunk("\",\"sha256\":\"");
            sendEscapedJsonChunk(sha);
            sendChunk("\",\"version\":\"");
            sendEscapedJsonChunk(version);
            sendChunk("\"}");
        }
        it = esp_partition_next(it);
    }
    esp_partition_iterator_release(it);
    sendChunk("]");
}

const char* partitionRole(const esp_partition_t* partition, const esp_partition_t* running, const esp_partition_t* boot, const esp_partition_t* nextOta) {
    if (!partition) {
        return "-";
    }
    if (samePartition(partition, running) && samePartition(partition, boot)) {
        return "running app / boot";
    }
    if (samePartition(partition, running)) {
        return "running app";
    }
    if (samePartition(partition, boot)) {
        return "boot app";
    }
    if (samePartition(partition, nextOta)) {
        return "next OTA";
    }
    if (partition->type == ESP_PARTITION_TYPE_APP) {
        return "app";
    }
    if (partition->type == ESP_PARTITION_TYPE_DATA) {
        switch (partition->subtype) {
            case ESP_PARTITION_SUBTYPE_DATA_NVS: return "NVS config";
            case ESP_PARTITION_SUBTYPE_DATA_OTA: return "OTA state";
            case ESP_PARTITION_SUBTYPE_DATA_SPIFFS: return "app data";
            case ESP_PARTITION_SUBTYPE_DATA_COREDUMP: return "coredump";
            default: return "data";
        }
    }
    return "-";
}

bool statusDetailsMode() {
    return g_server.hasArg("details") && g_server.arg("details") != "0";
}

void sendPartitionTable() {
    const esp_partition_t* running = esp_ota_get_running_partition();
    const esp_partition_t* boot = esp_ota_get_boot_partition();
    const esp_partition_t* nextOta = esp_ota_get_next_update_partition(nullptr);
    esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, nullptr);
    sendChunk("<section class='panel statuspage'><h2>Partition Table</h2><div class='tablewrap'><table class='part'><tr><th>Name</th><th>Type</th><th>SubType</th><th>Offset</th><th>Size</th><th>Role</th></tr>");
    while (it) {
        const esp_partition_t* p = esp_partition_get(it);
        if (p) {
            char offset[16];
            char sizeBuf[48];
            snprintf(offset, sizeof(offset), "0x%06lx", static_cast<unsigned long>(p->address));
            formatReadableBytes(p->size, sizeBuf, sizeof(sizeBuf));
            sendChunk("<tr><td>");
            sendEscapedHtmlChunk(p->label);
            sendChunk("</td><td>");
            sendEscapedHtmlChunk(partitionTypeName(p->type));
            sendChunk("</td><td>");
            sendEscapedHtmlChunk(partitionSubtypeName(p));
            sendChunk("</td><td>");
            sendEscapedHtmlChunk(offset);
            sendChunk("</td><td>");
            sendEscapedHtmlChunk(sizeBuf);
            sendChunk("</td><td>");
            sendEscapedHtmlChunk(partitionRole(p, running, boot, nextOta));
            sendChunk("</td></tr>");
        }
        it = esp_partition_next(it);
    }
    esp_partition_iterator_release(it);
    sendChunk("</table></div></section>");
}

