tangyangguang/Esp32Base/src/web/internal/WebStatus.cpp
void handleStatusPage() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    Esp32BaseWeb::sendHeader(g_builtinLabels[Esp32BaseWeb::BUILTIN_HOME]);
    Esp32BaseWeb::sendPageTitle(g_deviceName);

    char value[160];
    char uptime[32];
    char freeHeap[48];
    char minHeap[48];
    char maxAllocHeap[48];
    char totalHeap[48];
    char otaTargetSize[48] = "unavailable";
    char runningSlot[80] = "unknown";
    char bootSlot[80] = "unknown";
    char otaTargetSlot[80] = "unavailable";
    char flash[48];
    const bool details = statusDetailsMode();
    Esp32BaseLog::formatUptime(Esp32BaseSystem::uptimeMs(), uptime, sizeof(uptime));
    formatReadableBytes(Esp32BaseSystem::freeHeap(), freeHeap, sizeof(freeHeap));
    formatReadableBytes(Esp32BaseSystem::minFreeHeap(), minHeap, sizeof(minHeap));
    formatReadableBytes(ESP.getMaxAllocHeap(), maxAllocHeap, sizeof(maxAllocHeap));
    formatReadableBytes(Esp32BaseSystem::totalHeap(), totalHeap, sizeof(totalHeap));
    formatReadableBytes(Esp32BaseSystem::flashSize(), flash, sizeof(flash));
    const esp_partition_t* runningPartition = esp_ota_get_running_partition();
    const esp_partition_t* bootPartition = esp_ota_get_boot_partition();
    const esp_partition_t* nextPartition = esp_ota_get_next_update_partition(nullptr);
    if (runningPartition) {
        char runningSize[48];
        formatReadableBytes(runningPartition->size, runningSize, sizeof(runningSize));
        snprintf(runningSlot, sizeof(runningSlot), "%s / %s", runningPartition->label, runningSize);
    }
    if (bootPartition) {
        char bootSize[48];
        formatReadableBytes(bootPartition->size, bootSize, sizeof(bootSize));
        snprintf(bootSlot, sizeof(bootSlot), "%s / %s", bootPartition->label, bootSize);
    }
    if (nextPartition) {
        formatReadableBytes(nextPartition->size, otaTargetSize, sizeof(otaTargetSize));
        snprintf(otaTargetSlot, sizeof(otaTargetSlot), "%s / %s", nextPartition->label, otaTargetSize);
    }
    sendChunk("<div class='statusgrid'>");

    sendStatusSectionStart("Device");
    sendInfoRow("Name", g_deviceName);
    sendInfoRow("Hostname", Esp32Base::hostname());
    sendInfoRowStart("Firmware");
    sendEscapedHtmlChunk(Esp32Base::firmwareName());
    sendChunk(" ");
    sendEscapedHtmlChunk(Esp32Base::firmwareVersion());
    if (Esp32Base::firmwareBuild()[0]) {
        sendChunk(" <span class='info'>");
        sendEscapedHtmlChunk(Esp32Base::firmwareBuild());
        sendChunk("</span>");
    }
    sendInfoRowEnd();
    sendInfoRow("Profile", Esp32Base::profileName());
    sendInfoRow("Uptime", uptime);
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(Esp32BaseSystem::bootCount()));
    sendInfoRow("Boot count", value);
    sendStatusSectionEnd();

#if ESP32BASE_ENABLE_WIFI
    sendStatusSectionStart("Network");
    sendInfoRowStart("WiFi");
    sendEscapedHtmlChunk(Esp32BaseWiFi::stateName());
    if (Esp32BaseWiFi::ssid()[0]) {
        sendChunk(" / ");
        sendEscapedHtmlChunk(Esp32BaseWiFi::ssid());
    }
    sendInfoRowEnd();
    char ip[24] = "-";
    if (Esp32BaseWiFi::isConnected()) {
        Esp32BaseWiFi::ip(ip, sizeof(ip));
    }
    sendInfoRow("IP", ip);
    if (Esp32BaseWiFi::isConnected()) {
        snprintf(value, sizeof(value), "%ld dBm", static_cast<long>(Esp32BaseWiFi::rssi()));
    } else {
        strlcpy(value, "-", sizeof(value));
    }
    sendInfoRow("RSSI", value);
    sendInfoRow("Power save", Esp32BaseWiFi::powerSave() ? "on" : "off");
    sendInfoRow("STA MAC", WiFi.macAddress().c_str());
    sendInfoRow("AP MAC", WiFi.softAPmacAddress().c_str());
    sendStatusSectionEnd();
#endif

    sendStatusSectionStart("Runtime Health");
    sendInfoRowStart("Heap");
    sendSubmetricsStart();
    sendSubmetric("Free", freeHeap);
    sendSubmetric("Min", minHeap);
    sendSubmetric("Max alloc", maxAllocHeap);
    sendSubmetric("Total", totalHeap);
    sendSubmetricsEnd();
    sendInfoRowEnd();
#if ESP32BASE_ENABLE_WATCHDOG
    const WatchdogTripState watchdogTrip = readWatchdogTripState();
    char tripResetAt[32];
    formatWatchdogTripResetAt(watchdogTrip, tripResetAt, sizeof(tripResetAt));
    sendInfoRowStart("Watchdog");
    sendStatusTag(Esp32BaseWeb::UI_OK, "enabled");
    sendSubmetricsStart();
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(watchdogTrip.lifetime));
    sendSubmetric("Lifetime resets", value);
    if (watchdogTrip.invalidBase) {
        strlcpy(value, "invalid baseline", sizeof(value));
    } else {
        snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(watchdogTrip.trip));
    }
    sendSubmetric("Trip resets", value);
    sendSubmetric("Trip reset at", tripResetAt);
    sendSubmetricsEnd();
    sendInfoRowEnd();
#endif
#if ESP32BASE_ENABLE_TIME
    const Esp32BaseTime::Snapshot baseTime = Esp32BaseTime::snapshot();
    sendInfoRowStart("Time");
    if (baseTime.synced) {
        sendStatusTag(Esp32BaseWeb::UI_OK, "synced");
    } else {
        sendStatusTag(Esp32BaseWeb::UI_NEUTRAL, "uptime only");
    }
    sendSubmetricsStart();
    sendSubmetric("Source", Esp32BaseTime::sourceName(baseTime.source));
    if (baseTime.synced && Esp32BaseTime::formatTime(value, sizeof(value), "%Y-%m-%d %H:%M:%S")) {
        sendSubmetric("Current", value);
    }
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(baseTime.uptimeSec));
    sendSubmetric("Uptime sec", value);
    sendSubmetricsEnd();
    sendInfoRowEnd();
#endif
#if ESP32BASE_ENABLE_RTC
    sendInfoRowStart("RTC");
    if (Esp32BaseRtc::status() == Esp32BaseRtc::STATUS_OK) {
        sendStatusTag(Esp32BaseWeb::UI_OK, Esp32BaseRtc::statusText());
    } else if (Esp32BaseRtc::status() == Esp32BaseRtc::STATUS_NOT_STARTED) {
        sendStatusTag(Esp32BaseWeb::UI_NEUTRAL, Esp32BaseRtc::statusText());
    } else {
        sendStatusTag(Esp32BaseWeb::UI_WARN, Esp32BaseRtc::statusText());
    }
    sendSubmetricsStart();
    sendSubmetric("Driver", Esp32BaseRtc::driverName());
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(Esp32BaseRtc::lastEpoch()));
    sendSubmetric("Last epoch", value);
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(Esp32BaseRtc::lastSyncUptimeSec()));
    sendSubmetric("Last sync uptime", value);
    sendSubmetricsEnd();
    sendInfoRowEnd();
#endif
#if ESP32BASE_ENABLE_NTP
    const Esp32BaseNtp::TimeSnapshot ntpTime = Esp32BaseNtp::snapshot();
    sendInfoRowStart("NTP");
    if (!Esp32BaseNtp::isStarted()) {
        sendStatusTag(Esp32BaseWeb::UI_NEUTRAL, "not started");
    } else if (ntpTime.synced) {
        sendStatusTag(Esp32BaseWeb::UI_OK, "synced");
    } else {
        sendStatusTag(Esp32BaseWeb::UI_WARN, "pending");
    }
    if (ntpTime.synced && Esp32BaseNtp::formatTime(value, sizeof(value), "%Y-%m-%d %H:%M:%S")) {
        sendChunk("<br>");
        sendEscapedHtmlChunk(value);
    }
    sendInfoRowEnd();
#endif
    sendInfoRowStart("Last reset");
    sendEscapedHtmlChunk(Esp32BaseSystem::resetReason());
    sendChunk(" / ");
    sendEscapedHtmlChunk(Esp32BaseSystem::resetReasonText());
    sendInfoRowEnd();
    sendInfoRowStart("Last wake");
    sendEscapedHtmlChunk(Esp32BaseSystem::wakeReason());
    sendChunk(" / ");
    sendEscapedHtmlChunk(Esp32BaseSystem::wakeReasonText());
    sendInfoRowEnd();
    sendStatusSectionEnd();

#if ESP32BASE_ENABLE_FS || ESP32BASE_ENABLE_FILELOG
    sendStatusSectionStart("Storage & Logs");
#if ESP32BASE_ENABLE_FS
    if (Esp32BaseFs::isReady()) {
        sendFsQuickSummaryRows();
    } else {
        sendTaggedInfoRow("FS", "unavailable", Esp32BaseWeb::UI_WARN);
    }
#endif
#if ESP32BASE_ENABLE_FILELOG
    sendInfoRowStart("System logs");
    sendFileLogRuntimeStateTag();
    if (fileLogHasRuntimeDetails()) {
        char logLimit[48];
        char rotateFiles[12];
        formatReadableBytes(static_cast<uint64_t>(Esp32BaseFileLog::maxBytes()) * Esp32BaseFileLog::rotateFiles(), logLimit, sizeof(logLimit));
        snprintf(rotateFiles, sizeof(rotateFiles), "%u", static_cast<unsigned>(Esp32BaseFileLog::rotateFiles()));
        sendSubmetricsStart();
        sendSubmetric("Log level", Esp32BaseFileLog::modeName());
        sendSubmetric("Files", rotateFiles);
        sendSubmetric("Limit", logLimit);
        sendSubmetricsEnd();
    }
    sendInfoRowEnd();
    if (fileLogHasRuntimeDetails()) {
        sendInfoRow("Log path", Esp32BaseFileLog::path());
    }
#endif
    sendStatusSectionEnd();
#endif

    sendStatusSectionStart("Firmware & OTA");
    sendInfoRow("Running slot", runningSlot);
    sendInfoRow("Boot slot", bootSlot);
    sendInfoRow("OTA target slot", otaTargetSlot);
    sendInfoRow("Max OTA upload", otaTargetSize);
#if ESP32BASE_ENABLE_OTA
    sendInfoRow("Rollback", Esp32BaseOta::isRollbackPossible() ? "possible" : "not possible");
    if (Esp32BaseOta::lastError()[0]) {
        sendInfoRow("Last OTA error", Esp32BaseOta::lastError());
    }
#endif
    sendInfoRowStart("OTA & partition details");
    sendChunk(details ? "<a class='btnlink secondary' href='/esp32base/status'>Hide OTA &amp; partition details</a>" : "<a class='btnlink info' href='/esp32base/status?details=1'>Show OTA &amp; partition details</a>");
    sendInfoRowEnd();
    if (details) {
        sendFirmwareOtaDetails();
    }
    sendStatusSectionEnd();

    char mac[18];
    sendStatusSectionStart("Hardware");
    sendInfoRow("Chip", ESP.getChipModel());
    snprintf(value, sizeof(value), "%d", ESP.getChipRevision());
    sendInfoRow("Revision", value);
    snprintf(value, sizeof(value), "%u MHz", static_cast<unsigned>(ESP.getCpuFreqMHz()));
    sendInfoRow("CPU", value);
    sendInfoRow("SDK", ESP.getSdkVersion());
    sendInfoRow("Flash chip", flash);
    if (ESP.getPsramSize() > 0) {
        char psramTotal[48];
        char psramFree[48];
        formatReadableBytes(ESP.getPsramSize(), psramTotal, sizeof(psramTotal));
        formatReadableBytes(ESP.getFreePsram(), psramFree, sizeof(psramFree));
        snprintf(value, sizeof(value), "free %s, total %s", psramFree, psramTotal);
        sendInfoRow("PSRAM", value);
    }
    formatMac(ESP.getEfuseMac(), mac, sizeof(mac));
    sendInfoRow("eFuse MAC", mac);
    sendStatusSectionEnd();
    sendChunk("</div>");

    sendChunk("<section class='panel appsection'><h2>System settings</h2><p class='muted'>Open device settings and maintenance even when the footer bar is hidden.</p><div class='actions'><a class='btnlink' href='/esp32base/system'>Open System</a></div></section>");

    if (g_homeMode == Esp32BaseWeb::HOME_ESP32BASE && appNavCount() > 0) {
        sendChunk("<section class='panel appsection'><h2>Application</h2>");
        sendAppLinks(true, nullptr);
        sendChunk("</section>");
    }

    if (details) {
        sendPartitionTable();
    }
    Esp32BaseWeb::sendFooter();
}

} // namespace esp32base_web

#endif
